# Working with Excel Files

In [1]:
import pandas as pd

url = 'https://github.com/onlookertozip/bigStudy/blob/master/phone.xlsx?raw=true'

In [2]:
스마트폰=pd.read_excel(url, engine = 'openpyxl')

In [3]:
스마트폰.head()

,Unnamed: 0,스마트폰 관련,Unnamed: 2,Unnamed: 3,사용자 관련,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,출시년도,구매시기,디스플레이 크기\n(인치),연령,키\n(cm),몸무게\n(kg),평균 스마트폰\n사용시간\n(분/일),평균 컴퓨터\n사용시간\n(분/일),데이터\n사용량\n(mb/일)
1,1.0,2015,2015,5,45,173,75,60,500,100
2,2.0,2014,2015,4.5,27,176,59,70,30,50
3,3.0,2015,2015,5,29,183,65,120,300,200
4,4.0,2015,2016,5,28,172,63,80,60,190

In [4]:
# 행 개수
len(스마트폰)

25

In [5]:
# 열 개수
len(스마트폰.columns)

10

In [6]:
스마트폰.shape

(25, 10)

In [7]:
스마트폰.to_csv('스마트폰.csv')

# Data Structures

## Series

In [2]:
import pandas as pd
songs1 = pd.Series([145, 142, 38, 13])
songs1

0    145
1    142
2     38
3     13
dtype: int64

In [3]:
import numpy as np
numpy_ser = np.array([145, 142, 38, 13])

In [4]:
songs1[1]

142

In [5]:
numpy_ser[1]

142

In [6]:
songs1.mean()

84.5

In [7]:
numpy_ser.mean()

84.5

In [20]:
george_dupe = pd.Series([10, 7, 1, 22],index=['1968', '1969', '1970', '1971'],name='George Songs')

In [21]:
george_dupe

1968    10
1969     7
1970     1
1971    22
Name: George Songs, dtype: int64

In [22]:
george_dupe['1968']

10

In [27]:
george_dupe != 2

1968    True
1969    True
1970    True
1971    True
Name: George Songs, dtype: bool

In [28]:
george_dupe.loc[george_dupe != 2]

1968    10
1969     7
1970     1
1971    22
Name: George Songs, dtype: int64

In [29]:
george_dupe['1969'] = 6
george_dupe['1969']

6

In [30]:
del george_dupe['1971']
george_dupe

1968    10
1969     6
1970     1
Name: George Songs, dtype: int64

In [24]:
george_dupe.iloc[0]

10

In [23]:
george_dupe.loc["1968"]

10

In [26]:
george_dupe.iloc[0:3]

1968    10
1969     7
1970     1
Name: George Songs, dtype: int64

In [25]:
george_dupe.loc["1968":"1970"]

1968    10
1969     7
1970     1
Name: George Songs, dtype: int64

In [31]:
george_dupe = pd.Series([10, 7, 1, 22], index=['1968', '1969', '1970', '1970'], name='George Songs')

In [32]:
george_dupe.at['1970']

1970     1
1970    22
Name: George Songs, dtype: int64

In [33]:
george_dupe.loc['1970']

1970     1
1970    22
Name: George Songs, dtype: int64

In [36]:
george_dupe.iloc[0:2]

1968    10
1969     7
Name: George Songs, dtype: int64

In [37]:
mask = george_dupe > 7
mask

1968     True
1969    False
1970    False
1970     True
Name: George Songs, dtype: bool

In [38]:
songs_66 = pd.Series([3, None , 11, 9], index=['George', 'Ringo', 'John', 'Paul'], name='Counts')

In [41]:
songs_69 = pd.Series([18, 22, 7, 5], index=[ 'John', 'Paul','George', 'Ringo'], name='Counts')

In [42]:
for value in songs_66:
    print(value)

3.0
nan
11.0
9.0

In [43]:
songs_66 + songs_69

George    10.0
John      29.0
Paul      31.0
Ringo      NaN
Name: Counts, dtype: float64

In [44]:
songs_66

George     3.0
Ringo      NaN
John      11.0
Paul       9.0
Name: Counts, dtype: float64

In [45]:
songs_66['John']

11.0

In [47]:
songs_66.reset_index()

    index  Counts
0  George     3.0
1   Ringo     NaN
2    John    11.0
3    Paul     9.0

In [49]:
songs_66 = pd.Series([3, None , 11, 9], index=['George', 'Ringo', 'John', 'Paul'], name='Counts')

songs_66

George     3.0
Ringo      NaN
John      11.0
Paul       9.0
Name: Counts, dtype: float64

In [50]:
songs_66.sum(0)

23.0

In [51]:
songs_66.mean()

7.666666666666667

In [52]:
songs_66.median()

9.0

In [53]:
songs_66.quantile()

9.0

In [55]:
songs_66.quantile(.1)

4.2

In [56]:
songs_66.quantile(.9)

10.6

In [57]:
songs_66.describe()

count     3.000000
mean      7.666667
std       4.163332
min       3.000000
25%       6.000000
50%       9.000000
75%      10.000000
max      11.000000
Name: Counts, dtype: float64

In [58]:
songs_66.min()

3.0

In [59]:
songs_66.idxmin()

'George'

In [61]:
songs_66.max()

11.0

In [62]:
songs_66.idxmax()

'John'

In [63]:
songs_66.var()

17.333333333333336

In [64]:
songs_66.std()

4.163331998932266

In [65]:
songs_66.mad()

3.1111111111111107

## DataFrames

In [11]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터프레임을 만듭니다.
dataframe = pd.DataFrame()

# 열을 추가합니다.
dataframe['Name'] = ['Jacky Jackson', 'Steven Stevenson']
dataframe['Age'] = [38, 25]
dataframe['Driver'] = [True, False]

# 데이터프레임을 확인합니다.
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [2]:
# 열을 만듭니다.
new_person = pd.Series(['Molly Mooney', 40, True], index=['Name','Age','Driver'])

# 열을 추가합니다.
dataframe.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [3]:
import numpy as np
import pandas as pd

data = [ ['Jacky Jackson', 38, True], ['Steven Stevenson', 25, False] ]

matrix = np.array(data)
pd.DataFrame(matrix, columns=['Name', 'Age', 'Driver'])

               Name Age Driver
0     Jacky Jackson  38   True
1  Steven Stevenson  25  False

In [4]:
pd.DataFrame(data, columns=['Name', 'Age', 'Driver'])

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [5]:
data = {'Name': ['Jacky Jackson', 'Steven Stevenson'],
        'Age': [38, 25],
        'Driver': [True, False]}
pd.DataFrame(data)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [6]:
data = [ {'Name': 'Jacky Jackson', 'Age': 38, 'Driver': True},
         {'Name': 'Steven Stevenson', 'Age': 25, 'Driver': False} ]
pd.DataFrame(data, index=['row1', 'row2'])

                  Name  Age  Driver
row1     Jacky Jackson   38    True
row2  Steven Stevenson   25   False

In [14]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터를 적재합니다.
dataframe = pd.read_csv("bigStudy/titanic.csv")

# 두 개의 행을 확인합니다.
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [17]:
# 차원을 확인합니다.
dataframe.shape

(891, 12)

In [18]:
# 통곗값을 확인합니다.
dataframe.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [15]:
# 통곗값을 계산합니다.
print('최댓값:', dataframe['Age'].max())
print('최솟값:', dataframe['Age'].min())
print('평균:', dataframe['Age'].mean())
print('합:', dataframe['Age'].sum())
print('카운트:', dataframe['Age'].count())

최댓값: 80.0
최솟값: 0.42
평균: 29.69911764705882
합: 21205.17
카운트: 714

In [16]:
# 카운트를 출력합니다.
dataframe.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Gender         891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [17]:
# 수치형 열의 공분산을 계산합니다.
dataframe.cov()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,66231.000000,-0.626966,-7.561798,138.696504,-16.325843,-0.342697,161.883369
Survived,-0.626966,0.236772,-0.137703,-0.551296,-0.018954,0.032017,6.221787
Pclass,-7.561798,-0.137703,0.699015,-4.496004,0.076599,0.012429,-22.830196
Age,138.696504,-0.551296,-4.496004,211.019125,-4.163334,-2.344191,73.849030
SibSp,-16.325843,-0.018954,0.076599,-4.163334,1.216043,0.368739,8.748734
Parch,-0.342697,0.032017,0.012429,-2.344191,0.368739,0.649728,8.661052
Fare,161.883369,6.221787,-22.830196,73.849030,8.748734,8.661052,2469.436846

In [18]:
# 수치형 열의 상관계수를 계산합니다.
dataframe.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [1]:
import pandas as pd

df = pd.DataFrame(
    [[1, 10, 100], [2, 20, 200], [3, 30, 300]],
    index=["r1", "r2", "r3"],
    columns=["c1", "c2", "c3"],
)
df

    c1  c2   c3
r1   1  10  100
r2   2  20  200
r3   3  30  300

In [2]:
df.loc["r2", "c2"]

20

In [3]:
df.loc["r2", :]

c1      2
c2     20
c3    200
Name: r2, dtype: int64

In [4]:
df.loc[:, "c2"]

r1    10
r2    20
r3    30
Name: c2, dtype: int64

In [5]:
df.loc[["r1", "r3"], "c2":"c3"]

    c2   c3
r1  10  100
r3  30  300

In [6]:
df.iloc[1:3, [0, 2]]

    c1   c3
r2   2  200
r3   3  300

In [7]:
df["c2"]

r1    10
r2    20
r3    30
Name: c2, dtype: int64

In [8]:
df > 10

       c1     c2    c3
r1  False  False  True
r2  False   True  True
r3  False   True  True

In [9]:
df.loc[df["c2"] > 10]

    c1  c2   c3
r2   2  20  200
r3   3  30  300

In [10]:
df.loc[(df["c1"] > 1) & (df["c3"] < 300)]

    c1  c2   c3
r2   2  20  200

# Data Cleanup: Investigation, Matching, and Formatting

## Query and replace

### Query

In [10]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터를 적재합니다.
dataframe = pd.read_csv("bigStudy/titanic.csv")

# 두 개의 행을 확인합니다.
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [11]:
# 첫 번째 행을 선택합니다.
dataframe.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Gender                            male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [20]:
# 세 개의 행을 선택합니다.
dataframe.iloc[1:4]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [21]:
# 네 개의 행을 선택합니다.
dataframe.iloc[:4]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [23]:
# 인덱스를 설정합니다.
dataframe = dataframe.set_index(dataframe['Name'])

# 행을 확인합니다.
dataframe.loc['Braund, Mr. Owen Harris']

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Gender                            male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: Braund, Mr. Owen Harris, dtype: object

In [28]:
# dataframe[:2]와 동일합니다.
dataframe[:'Braund, Mr. Owen Harris']

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [34]:
dataframe[['Age', 'Gender']].head(2)

                                                     Age  Gender
Name
Braund, Mr. Owen Harris                             22.0    male
Cumings, Mrs. John Bradley (Florence Briggs Tha...  38.0  female

In [35]:
# ‘Gender’ 열이 ‘female’인 행 중 처음 두 개를 출력합니다.
dataframe[dataframe['Gender'] == 'female'].head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [38]:
# 행을 필터링합니다.
dataframe[(dataframe['Gender'] == 'female') & (dataframe['Age'] >= 60)]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Andrews, Miss. Kornelia Theodosia",276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
"Turkula, Mrs. (Hedwig)",484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
"Stone, Mrs. George Nelson (Martha Evelyn)",830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

### Replacing

In [43]:
# 값을 치환하고 두 개의 행을 출력합니다.
dataframe['Gender'].replace("female", "Woman").head(2)

0     male
1    Woman
Name: Gender, dtype: object

In [44]:
# "female"과 "male을 "Woman"과 "Man"으로 치환합니다.
dataframe['Gender'].replace(["female", "male"], ["Woman", "Man"]).head(5)

0      Man
1    Woman
2    Woman
3    Woman
4      Man
Name: Gender, dtype: object

In [45]:
# 값을 치환하고 두 개의 행을 출력합니다.
dataframe.replace(1, "One").head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,One,0,3,"Braund, Mr. Owen Harris",male,22,One,0,A/5 21171,7.2500,NaN,S
1,2,One,One,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,One,0,PC 17599,71.2833,C85,C

In [46]:
# 값을 치환하고 두 개의 행을 출력합니다.
dataframe.replace(r"1st", "First", regex=True).head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [47]:
# female과 male을 person으로 바꿉니다.
dataframe.replace(["female", "male"], "person").head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",person,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",person,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",person,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [48]:
# female을 1로 바꾸고 male을 0으로 바꿉니다.
dataframe.replace({"female": 1, "male": 0}).head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [49]:
# 열 이름을 바꾸고 두 개의 행을 출력합니다.
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [50]:
# 라이브러리를 임포트합니다.
import collections

# 딕셔너리를 만듭니다.
column_names = collections.defaultdict(str)

# 키를 만듭니다.
for name in dataframe.columns:
    column_names[name]

# 딕셔너리를 출력합니다.
column_names

defaultdict(str,
            {'PassengerId': '',
             'Survived': '',
             'Pclass': '',
             'Name': '',
             'Gender': '',
             'Age': '',
             'SibSp': '',
             'Parch': '',
             'Ticket': '',
             'Fare': '',
             'Cabin': '',
             'Embarked': ''})

In [51]:
# 인덱스 0을 -1로 바꿉니다.
dataframe.rename(index={0:-1}).head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
-1,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [52]:
# 열 이름을 소문자로 바꿉니다.
dataframe.rename(str.lower, axis='columns').head(2)

,passengerid,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

## Finding Outliers and Bad Data

### 고유한 값

In [12]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터를 적재합니다.
dataframe = pd.read_csv("bigStudy/titanic.csv")

# 두 개의 행을 확인합니다.
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [24]:
# 고유한 값을 찾습니다.
dataframe['Gender'].unique()

array(['male', 'female'], dtype=object)

In [25]:
# 카운트를 출력합니다.
dataframe['Gender'].value_counts()

male      577
female    314
Name: Gender, dtype: int64

In [27]:
# 카운트를 출력합니다.
dataframe['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [28]:
# 고유한 값의 개수를 출력합니다.
dataframe['Pclass'].nunique()

3

In [29]:
dataframe.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Gender           2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

### 누락된 값

In [30]:
## 누락된 값을 선택하고 두 개의 행을 출력합니다.
dataframe[dataframe['Age'].isnull()].head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S

In [32]:
# NaN으로 값을 바꾸려고 합니다.
dataframe['Gender'] = dataframe['Gender'].replace('male', NaN)

NameError: name 'NaN' is not defined

In [34]:
# 라이브러리를 임포트합니다.
import numpy as np

# NaN으로 값을 바꿉니다.
dataframe['Gender'] = dataframe['Gender'].replace('male', np.nan)

In [35]:
# 데이터를 적재하고 누란된 값을 설정합니다.
dataframe = pd.read_csv("bigStudy/titanic.csv", na_values=[np.nan, 'NONE', -999])

In [36]:
dataframe = pd.read_csv("bigStudy/titanic.csv", na_values=['female'], 
                        keep_default_na=False)
dataframe[12:14]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,13,0,3,"Saundercock, Mr. William Henry",male,20,0,0,A/5. 2151,8.050,,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39,1,5,347082,31.275,,S

In [37]:
dataframe = pd.read_csv("bigStudy/titanic.csv", na_filter=False)
dataframe[12:14]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,13,0,3,"Saundercock, Mr. William Henry",male,20,0,0,A/5. 2151,8.050,,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39,1,5,347082,31.275,,S

### 열 삭제

In [38]:
# 열을 삭제합니다.
dataframe.drop('Age', axis=1).head(2)

,PassengerId,Survived,Pclass,Name,Gender,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C

In [39]:
# 열을 삭제합니다.
dataframe.drop(['Age', 'Gender'], axis=1).head(2)

,PassengerId,Survived,Pclass,Name,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,0,PC 17599,71.2833,C85,C

In [40]:
# PClass 열을 삭제합니다.
dataframe.drop(dataframe.columns[1], axis=1).head(2)

,PassengerId,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C

In [41]:
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C

### 행 삭제

In [43]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터를 적재합니다.
dataframe = pd.read_csv("bigStudy/titanic.csv")

# 두 개의 행을 확인합니다.
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [45]:
# 행을 삭제하고 처음 두 개의 행을 출력합니다.
dataframe[dataframe['Gender'] != 'male'].head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [46]:
# 행을 삭제하고 처음 두 개의 행을 출력합니다.
dataframe[dataframe['Name'] != 'Heikkinen, Miss. Laina	'].head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [47]:
# 행을 삭제하고 처음 두 개의 행을 출력합니다.
dataframe[dataframe.index != 0].head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [49]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터를 적재합니다.
dataframe = pd.read_csv("bigStudy/titanic.csv")

# 두 개의 행을 확인합니다.
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [50]:
# 중복 행을 삭제하고 처음 두 개의 행을 출력합니다.
dataframe.drop_duplicates().head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [51]:
# 행의 개수를 출력합니다.
print("원본 데이터프레임 행의 수:", len(dataframe))
print("중복 삭제 후 행의 수:", len(dataframe.drop_duplicates()))

원본 데이터프레임 행의 수: 891
중복 삭제 후 행의 수: 891

In [52]:
# 중복된 행을 삭제합니다.
dataframe.drop_duplicates(subset=['Gender'])

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [53]:
# 중복된 행을 삭제합니다.
dataframe.drop_duplicates(subset=['Gender'], keep='last')

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### 그룹핑하기

In [54]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터를 적재합니다.
dataframe = pd.read_csv("bigStudy/titanic.csv")

# 두 개의 행을 확인합니다.
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [55]:
# ‘Gender’ 열의 값으로 행을 그룹핑하고 평균을 계산합니다.
dataframe.groupby('Gender').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Gender,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [56]:
# 행을 그룹핑합니다.
dataframe.groupby('Gender')

In [57]:
# 행을 그룹핑하고 카운팅합니다.
dataframe.groupby('Survived')['Name'].count()

Survived
0    549
1    342
Name: Name, dtype: int64

In [58]:
# 행을 그룹핑한 다음 평균을 계산합니다.
dataframe.groupby(['Gender','Survived'])['Age'].mean()

Gender  Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64

In [13]:
# 라이브러리를 임포트합니다.
import pandas as pd
import numpy as np

# 날짜 범위를 만듭니다.
time_index = pd.date_range('01/01/2021', periods=100000, freq='30S')

# 데이터프레임을 만듭니다.
dataframe = pd.DataFrame(index=time_index)

# 난수 값으로 열을 만듭니다.
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)

# 주 단위로 행을 그룹핑한 다음 합을 계산합니다.
dataframe.resample('W').sum()

            Sale_Amount
2021-01-03        43846
2021-01-10       101291
2021-01-17       100896
2021-01-24       100746
2021-01-31       101384
2021-02-07        53431

In [60]:
# 세개의 행을 출력합니다.
dataframe.head(3)

                     Sale_Amount
2021-01-01 00:00:00            7
2021-01-01 00:00:30            5
2021-01-01 00:01:00            8

In [61]:
# 2주 단위로 그룹핑하고 평균을 계산합니다.
dataframe.resample('2W').mean()

            Sale_Amount
2021-01-03     5.031829
2021-01-17     4.987227
2021-01-31     5.001538
2021-02-14     4.977985

In [62]:
# 한 달 간격으로 그룹핑하고 행을 카운트합니다.
dataframe.resample('M').count()

            Sale_Amount
2021-01-31        89280
2021-02-28        10720

In [63]:
# 월 간격으로 그룹핑하고 행을 카운트합니다.
dataframe.resample('M', label='left').count()

            Sale_Amount
2020-12-31        89280
2021-01-31        10720

In [64]:
dataframe.resample('MS').count()

            Sale_Amount
2021-01-01        89280
2021-02-01        10720

### 원소 순회

In [65]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터를 적재합니다.
dataframe = pd.read_csv("bigStudy/titanic.csv")

# 두 개의 행을 확인합니다.
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [66]:
# 처음 두 이름을 대문자로 바꾸어 출력합니다.
for name in dataframe['Name'][0:2]:
    print(name.upper())

BRAUND, MR. OWEN HARRIS
CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)

In [67]:
# 처음 두 이름을 대문자로 바꾸어 출력합니다.
[name.upper() for name in dataframe['Name'][0:2]]

['BRAUND, MR. OWEN HARRIS',
 'CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)']

### 함수 적용하기

In [77]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터를 적재합니다.
dataframe = pd.read_csv("bigStudy/titanic.csv")

# 두 개의 행을 확인합니다.
dataframe.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [78]:
# 함수를 만듭니다.
def uppercase(x):
    return x.upper()

# 함수를 적용하고 두 개의 행을 출력합니다.
dataframe['Name'].apply(uppercase)[0:2]

0                              BRAUND, MR. OWEN HARRIS
1    CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
Name: Name, dtype: object

In [79]:
# Survived 열의 1을 Live로, 0을 Dead로 바꿉니다.
dataframe['Survived'].map({1:'Live', 0:'Dead'})[:5]

0    Dead
1    Live
2    Live
3    Live
4    Dead
Name: Survived, dtype: object

In [97]:
# 함수의 매개변수(age)를 apply 메서드를 호출할 때 전달할 수 있습니다.
dataframe['Age'].apply(lambda x, age: x < age, age=30)[:5]

0     True
1    False
2     True
3    False
4    False
Name: Age, dtype: bool

In [98]:
def truncate_string(x):
    if type(x) == str:
        return x[:20]
    return x

# 문자열의 길이를 최대 20자로 줄입니다.
dataframe.applymap(truncate_string)[:5]

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Har",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John B",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Lai",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacqu",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William H",male,35.0,0,0,373450,8.0500,NaN,S

In [99]:
# 행을 그룹핑한 다음 함수를 적용합니다.
dataframe.groupby('Gender').apply(lambda x: x.count())

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Gender,,,,,,,,,,,,
female,314,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,577,453,577,577,577,577,107,577

### 데이터프레임 연결

In [1]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터프레임을 만듭니다.
data_a = {'id': ['1', '2', '3'],
          'first': ['Alex', 'Amy', 'Allen'],
          'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])

# 데이터프레임을 만듭니다.
data_b = {'id': ['4', '5', '6'],
          'first': ['Billy', 'Brian', 'Bran'],
          'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])

# 행 방향으로 데이터프레임을 연결합니다.
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [2]:
# 열 방향으로 데이터프레임을 연결합니다.
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [3]:
# 행을 만듭니다.
row = pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])

# 행을 추가합니다.
dataframe_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

### 데이터프레임 병합

In [4]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터프레임을 만듭니다.
employee_data = {'employee_id': ['1', '2', '3', '4'],
                 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
                 'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id',
                                                              'name'])

# 데이터프레임을 만듭니다.
sales_data = {'employee_id': ['3', '4', '5', '6'],
              'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id',
                                                      'total_sales'])

# 데이터프레임을 병합합니다.
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [5]:
# 데이터프레임을 병합합니다.
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [6]:
# 데이터프레임을 병합합니다.
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [7]:
# 데이터프레임을 병합합니다.
pd.merge(dataframe_employees,
         dataframe_sales,
         left_on='employee_id',
         right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

## Formatting Data

### 파이썬으로 글자 처리

In [8]:
print("Hello!")

Hello!

In [9]:
print('한글도 쓸 수 있어요.')

한글도 쓸 수 있어요.

In [10]:
print("내 이름은 " + "홍길동" + "입니다.")

내 이름은 홍길동입니다.

In [11]:
print("*" * 10)

**********

In [13]:
#숫자를 문자열로 바꾸기
n = 10
print("별표를 " + str(n) + "번 출력합니다.")
print("*" * n)

별표를 10번 출력합니다.
**********

In [14]:
print("한 줄 쓰고\n그 다음 줄을 쓴다.")

한 줄 쓰고
그 다음 줄을 쓴다.

In [15]:
# 줄을 바꾸지 않고 이어서 출력하기
print("한 줄 쓰고 ", end="")
print("이어서 쓴다.")

한 줄 쓰고 이어서 쓴다.

In [16]:
#문자열 값을 가지는 변수
name = "홍길동"
print("내 이름은 " + name + "입니다.")

내 이름은 홍길동입니다.

In [17]:
mark = "$"
n = 20
print(mark + " 기호를 " + str(n) + "번 출력합니다.")
print(mark * n)

$ 기호를 20번 출력합니다.
$$$$$$$$$$$$$$$$$$$$

In [18]:
# 따옴표를 출력하기
print('둘리가 "호이!"하고 말했어요.')

둘리가 "호이!"하고 말했어요.

In [19]:
print("둘리가 '이제 어디로 가지?'하고 생각했어요.")

둘리가 '이제 어디로 가지?'하고 생각했어요.

In [20]:
multi_line_string = """
파이썬(영어: Python)은 1991년 프로그래머인 
귀도 반 로섬(Guido van Rossum)이 발표한 고급 프로그래밍 언어로,
플랫폼 독립적이며 인터프리터식, 객체지향적, 동적 타이핑(dynamically typed) 
대화형 언어이다. 파이썬이라는 이름은 귀도가 좋아하는 코미디 〈Monty Python's Flying 
Circus〉에서 따온 것이다."""

print(multi_line_string)

파이썬(영어: Python)은 1991년 프로그래머인
귀도 반 로섬(Guido van Rossum)이 발표한 고급 프로그래밍 언어로,
플랫폼 독립적이며 인터프리터식, 객체지향적, 동적 타이핑(dynamically typed)
대화형 언어이다. 파이썬이라는 이름은 귀도가 좋아하는 코미디 〈Monty Python's Flying
Circus〉에서 따온 것이다.

In [17]:
"2020.10.23".replace(".","-")

'2020-10-23'

In [18]:
"word with sapce".replace(" ","")

'wordwithsapce'

### 문자열 형식화

In [21]:
# 문자열 형식화
"내 이름은 %s입니다." % "홍길동"

'내 이름은 홍길동입니다.'

In [22]:
"나는 %d살 입니다." % 12

'나는 12살 입니다.'

In [23]:
"원주율의 값은 %f입니다." % 3.141592

'원주율의 값은 3.141592입니다.'

In [24]:
"%d 곱하기 %d은 %d이다." % (2, 3, 6)

'2 곱하기 3은 6이다.'

In [25]:
"%s의 %s 과목 점수는 %d점이다." % ("철수", "수학", 100)

'철수의 수학 과목 점수는 100점이다.'

In [26]:
# 고급 형식지정 문자열
"[%20s]" % "*"   # [와 ] 사이에 20칸의 공백이 있다.

'[                   *]'

In [27]:
"[%-20s]" % "A"  # 20칸의 공백의 앞쪽에 A를 인쇄한다.

'[A                   ]'

In [28]:
"[%20d]" % 123  # 20칸의 공백의 뒷쪽에 123을 인쇄한다.

'[                 123]'

In [29]:
"[%-20d]" % 123  # 20칸의 공백의 앞쪽에 123을 인쇄한다.

'[123                 ]'

In [30]:
x = 1 / 3.0  # 값은 0.3333333....
"%.5f" % x   # 소숫점 아래 5자리까지만 인쇄한다.

'0.33333'

In [31]:
"[%-20.6f]" % x  # 20칸의 공백의 앞쪽에 소숫점 아래 6자리 출력

'[0.333333            ]'

In [32]:
# format 메서드
"내 이름은 {}입니다.".format("홍길동")

'내 이름은 홍길동입니다.'

In [33]:
"내 이름은 {{{}}}입니다.".format("홍길동")

'내 이름은 {홍길동}입니다.'

In [34]:
"{2}의 {0} 점수는 {1}점입니다. {1}점! {1}점!".format("수학", 100, "철수")

'철수의 수학 점수는 100점입니다. 100점! 100점!'

In [35]:
"{a}점수: {x}점, {b}점수: {y}점".format(a="영어", b="수학", x=100, y=90)

'영어점수: 100점, 수학점수: 90점'

In [36]:
"{}점수: {}점, {}점수: {}점".format("영어", 100, "수학", 90)

'영어점수: 100점, 수학점수: 90점'

In [37]:
"[{:<20}]".format("*")

'[*                   ]'

In [38]:
"[{:>20}]".format("*")

'[                   *]'

In [39]:
"[{:^20}]".format("*")

'[         *          ]'

In [40]:
"[{:20.5f}]".format(1 / 3)

'[             0.33333]'

In [41]:
"[{:20,}]".format(1234567890)

'[       1,234,567,890]'

In [42]:
"[{:-<20}]".format("*")

'[*-------------------]'

In [43]:
"[{:->20}]".format("*")

'[-------------------*]'

In [44]:
"[{:-^20}]".format("*")

'[---------*----------]'

In [45]:
x = [10, 11, 12]
"리스트의 첫번째 원소={0[0]}".format(x)

'리스트의 첫번째 원소=10'

In [46]:
y = {"a": 10, "b": 11, "c": 12}
"사전의 a키 값={0[a]}".format(y)

'사전의 a키 값=10'

In [47]:
# f 문자열
name = "홍길동"
age = 32
print(f"{name}의 나이는 {age}살이다.")

홍길동의 나이는 32살이다.

In [48]:
number = 1234567

In [49]:
f"[{number:<20}]"

'[1234567             ]'

In [50]:
f"[{number:>20}]"

'[             1234567]'

In [51]:
f"[{number:^20}]"

'[      1234567       ]'

In [52]:
f"[{number:-<20}]"

'[1234567-------------]'

In [53]:
f"[{number:->20}]"

'[-------------1234567]'

In [54]:
f"[{number:-^20}]"

'[------1234567-------]'

In [55]:
f"[{number:-^20,}]"

'[-----1,234,567------]'

In [56]:
f_number = 3.141592

In [57]:
f"[{f_number:20.3f}]"

'[               3.142]'